package ru.stimmax.lessons.lesson12.homework

fun main() {

//Задачи на приведение коллекции к значению
    val collection1 = listOf(1, 2, 3, 4, 5)

//1. Проверить, что размер коллекции больше 5 элементов.
    val task1 = collection1.size > 5

//2. Проверить, что коллекция пустая
    val task2 = collection1.isEmpty()

//3. Проверить, что коллекция не пустая
    val task3 = collection1.isNotEmpty()

//4. Взять элемент по индексу или создать значение если индекса не существует
    val task4 = collection1.getOrElse(2) { 10 }

//5. Собрать коллекцию в строку
    val task5 = collection1.joinToString()

//6. Посчитать сумму всех значений
    val task6 = collection1.sum()

//7. Посчитать среднее
    val task7 = collection1.average()

//8. Взять максимальное число
    val task8 = collection1.minOrNull()

//9. Взять минимальное число
    val task9 = collection1.maxOrNull()

//10. Взять первое число или null
    val task10 = collection1.firstOrNull()

//11. Проверить что коллекция содержит элемент
    val task11 = collection1.contains(6)

//Задачи на обработку коллекций
    val collection2 = listOf(10, 20, 30, 100)
    val collection3 = listOf("биба", "боба", "ололоша", null)
    val collection4 = listOf("биба", "боба", "ололоша")

//12. Отфильтровать коллекцию по диапазону 18-30
    val task12 = collection2.filter { it in 18..30 }

//13. Выбрать числа, которые не делятся на 2 и 3 одновременно
    val task13 = collection2.forEach{
        val notDivisioned = !(it % 2 == 0 && it % 3 == 0)
        if (notDivisioned){
            println(true)
        }

    }

//14. Очистить текстовую коллекцию от null элементов
    val task14 = collection3.filterNotNull()

//15. Преобразовать текстовую коллекцию в коллекцию длин слов
    val task15 = collection3.map { collection3 -> collection3?.length }

//16. Преобразовать текстовую коллекцию в мапу, где ключи - перевёрнутые слова, а значения - длина слов
    val task16 = collection3.associate { it?.reversed() to it?.length }

//17. Отсортировать список в алфавитном порядке
    val task17 = collection4.sorted()

//18. Взять первые 3 элемента списка
    val task18 = collection3.take(3)

//19. Распечатать квадраты элементов списка
    val task19 = collection2.map {it * 2}
    println(task19)

//21. Группировать список по первой букве слов
    val task21 = collection3.groupBy { it?.first() }

//22. Очистить список от дублей
    val task22 = collection3.distinct()

//23. Отсортировать список по убыванию
    val task23 = collection4.sortedDescending()

//24. Взять последние 3 элемента списка
    val task24 = collection3.takeLast(3)

//Задача 24. Характеристика числовой коллекции
//Напиши функцию, которая принимает коллекцию чисел и возвращает строку с характеристикой коллекции используя конструкцию when
//Если коллекция пустая - “Пусто”
//Если количество элементов меньше пяти - “Короткая”
//Если коллекция начинается с 0 - “Стартовая”
//Если сумма всех чисел больше 10000 - “Массивная”
//Если среднее значение равно 10 - “Сбалансированная”
//Если длина строки образованная склеиванием коллекции в строку равна 20 - “Клейкая”
//Если максимальное число меньше -10 - “Отрицательная”
//Если минимальное число больше 1000 - “Положительная”
//Если содержит одновременно числа 3 и 14 - “Пи***тая”
//Иначе - “Уникальная”
//Вызвать метод с данными, подходящими под каждую из веток

    fun task24(numbers: List<Int>):String{
    return when{
        numbers.isEmpty() -> "Пусто"
        numbers.size<5 -> "Короткая"
        numbers.first() == 0 -> "Стартовая"
        numbers.sum() > 1000 -> "Массивная"
        numbers.average() == 10.0 -> "Сбалансированная"
        numbers.joinToString {":"}.length == 20 -> "Клейкая"
        numbers.maxOrNull()!! < -10 -> "Отрицательная"
        numbers.minOrNull()!! > 1000 -> "Положительная"
        numbers.contains(3) && numbers.contains(14) -> "Пи***тая"
        else -> "Уникальная"
    }
}

//Напиши функцию, которая принимает список чисел и возвращает список чисел.
//Цель: Отфильтровать удовлетворительные оценки (>=60), отсортировать оставшиеся по возрастанию и взять первые 3. Вызывай методы обработки и фильтрации последовательно один из другого, чтобы результат предыдущего метода являлся основой для следующего.

    fun task24():List<Int> {
        return listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12)
            .filter { it >= 60 }
            .sorted()
            .take(3)
    }

//Задача 26. Создание каталога по первой букве
//Напиши функцию, которая принимает список строк и возвращает словарь с ключом - буквой и значением - строкой.
//Цель: Привести все слова в списке к нижнему регистру, сгруппировать в каталог по первой букве используя метод groupBy

    fun task26():Map<Char, List<String>> {
        return listOf(
            "Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф", "часы", "Люстра", "подушка", "Картина", "столик", "Вазон", "шторы", "Пуф", "книга", "Фоторамка", "светильник", "Коврик", "вешалка", "Подставка", "телевизор", "Комод", "полка", "Абажур", "диван", "Кресло", "занавеска", "Бра", "пепельница", "Глобус", "статуэтка", "Поднос", "фигурка", "Ключница", "плед", "Тумба", "игрушка", "Настенные часы", "подсвечник", "Журнальный столик", "сувенир", "Корзина для белья", "посуда", "Настольная лампа", "торшер", "Этажерка"
        )
        .map{ it.lowercase() }
        .groupBy { it.first() }

    }

//Задание 27. Подсчёт средней длины слов в списке
//Напиши функцию, которая принимает список строк и возвращает строку.
//Начальные значения взять из предыдущей задачи.
//Цель: Перевести все слова в количество букв, подсчитать среднее значение. Вернуть форматированный текст с двумя знаками после запятой, используя функцию format и подходящий шаблон.

    fun task27(list:List<String>):String{
            val average = list.map{it.length}.average()
            val formatted = String.format("%.2f", average)
        return formatted

    }

//Задание 28: Категоризация чисел
//Напиши функцию, которая принимает список чисел и возвращает словарь с ключами - строками и значениями - числами.
//Начальные значения: val numbers = listOf(1, 3, 5, 7, 3, 1, 8, 9, 9, 7)
//Цель: Отобрать уникальные числа, отсортировать по убыванию и сгруппировать по четности (“четные” и “нечетные”).

    fun task28(list:List<Int>): Map<String, List<Int>>{
        return listOf(1, 3, 5, 7, 3, 1, 8, 9, 9, 7)
            .distinct()
            .sortedDescending()
            .groupBy { if (it % 2 == 0)"Четные" else "Нечетные" }
    }

//Задание 29: Поиск первого подходящего элемента
//Напиши функцию, которая принимает список чисел и число и возвращает nullable число.
//Начальные значения: val ages = listOf(22, 18, 30, 45, 17, null, 60) и число для проверки возраста, например 18.
//Цель: Найти первый возраст в списке, который соответствует условию (больше второго аргумента) и вернуть его, либо null если значения не нашлось.

fun task29(ages:List<Int?>, checkAge:Int):Int? {
    val result = ages.firstOrNull{it != null && it > checkAge }
    return result
}
}