package ru.stimmax.lessons.lesson10.homework

fun main(){
//Задачи на работу со словарём
// 1. Создайте пустой неизменяемый словарь, где ключи и значения - целые числа.
    val task1 = mapOf<Int, Int>()

// 2. Создайте словарь, инициализированный несколькими парами "ключ-значение", где ключи - float, а значения - double
    val task2 = mapOf<Float, Double>(1.22f to 10.00, 40.66f to 5.5, 6.65f to 6.6)

// 3. Создайте изменяемый словарь, где ключи - целые числа, а значения - строки.
    val task3 = mutableMapOf<Int, String>()

// 4. Имея изменяемый словарь, добавьте в него новые пары "ключ-значение".
    val animals = mutableMapOf<String, String>("Млекопитающее" to "Лиса")
    animals ["Земноводное"] = "Лягуха"
// 5. Используя словарь из предыдущего задания, извлеките значение, используя ключ. Попробуй получить значение с ключом, которого в словаре нет.
    animals["Млекопитающее"]
    animals["Птица"]
    val result = animals["Птица"]
    if (result != null){
        println(result)
    } else {
        println("Такого ключа нет")
    }

// 6. Удалите определенный элемент из изменяемого словаря по его ключу.
    animals.remove("Ёж")

// 7. Создайте словарь (ключи Double, значения Int) и выведи в цикле результат деления ключа на значение. Не забудь обработать деление на 0 (в этом случае выведи слово “бесконечность”)
// 8. Измените значение для существующего ключа в изменяемом словаре.
    animals["Лиса"] = "Белка"

// 9. Создайте два словаря и объедините их в третьем изменяемом словаре через циклы.
// 10. Создайте словарь, где ключами являются строки, а значениями - списки целых чисел. Добавьте несколько элементов в этот словарь.
// 11. Создай словарь, в котором ключи - это целые числа, а значения - изменяемые множества строк. Добавь данные в словарь. Получи значение по ключу (это должно быть множество строк) и добавь в это множество ещё строку. Распечатай полученное множество.
// 12. Создай словарь, где ключами будут пары чисел. Через перебор найди значение у которого пара будет содержать цифру 5 в качестве первого или второго значения.

//Задачи на подбор оптимального типа для словаря
// 1. Словарь библиотека: Ключи - автор книги, значения - список книг
    val library = mutableMapOf<String, MutableList<String>>()
    library ["Эдгар Алан По"]= mutableListOf<String>("Падение Дома Ашеров", "Ворон")

// 2. Справочник растений: Ключи - типы растений (например, "Цветы", "Деревья"), значения - списки названий растений
    val plants = mutableMapOf<String, MutableList<String>>()
    plants["Цветы"] = mutableListOf<String>("Розы","Гвоздики")
    plants["Деревья"] = mutableListOf<String>("Дуб","Кипарис")

// 3. Четвертьфинала: Ключи - названия спортивных команд, значения - списки игроков каждой команды
    val quarterFinal = mutableMapOf<String, MutableList<String>>()
    quarterFinal["Арсенал"] = mutableListOf<String>("Игрок такой-то", "Игрок сякой-то")

// 4. Курс лечения: Ключи - даты, значения - список препаратов принимаемых в дату
    val treatment = mapOf(
        "01 ноября" to listOf("Лекарство1"),
        "02 ноября" to listOf("Лекарство2")
    )


// 5. Словарь путешественника: Ключи - страны, значения - словари из городов со списком интересных мест.
    val travel = mutableMapOf<String, MutableMap<String, String>>()
    travel ["Япония"] = mutableMapOf("Осака" to "парк StudioUniversal")
    travel ["Япония"] ?.put("Киото", "храм Фушими Инари")

}